jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16LF777.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0x10E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PMADRH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="---xxxxx" edc:_addr="0x10F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="PMADRH" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x190" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1" edc:_addr="0x181"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0" edc:_addr="0x182"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x185"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1" edc:_addr="0x186"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x187"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0" edc:_addr="0x18A"/>
        <edc:SFRDef edc:access="-------s" edc:cname="PMCON1" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="-------0" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobnk"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xa0" edc:endaddr="0xf0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xf0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x110" edc:endaddr="0x170" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x190" edc:endaddr="0x1f0" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1f0" edc:endaddr="0x200" edc:regionid="gpr3s" edc:shadowidref="gprnobnk"/>
      <edc:EmulatorZone edc:beginaddr="0x18e" edc:endaddr="0x190" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="none">
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="CVref"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="Vref+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="SS"/>
      <edc:VirtualPin edc:name="C2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="RD"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="WR"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="CS"/>
      <edc:VirtualPin edc:name="AN7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="SCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="PSP0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="PSP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PSP2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PSP3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="SDA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="SDO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="TX"/>
      <edc:VirtualPin edc:name="CK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="RX"/>
      <edc:VirtualPin edc:name="DT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PSP4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PSP5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="PSP6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="PSP7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="AN10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CCP2"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="CCP3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
